
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Имя) Тогда
		ПриОткрытииНаСервере();
	Иначе
		АутентификацияСтандартная = Истина;
		ПоказыватьВСпискеВыбора = Истина;
		ЗаполнитьРоли();
	КонецЕсли;
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Пользователь,, "Роли, Пароль");
	Если Пользователь.ПарольУстановлен Тогда
		Пароль = "********";
		ПодтверждениеПароля = "********";
	КонецЕсли;
	ЗаполнитьРоли(Пользователь)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРоли(Пользователь = "")
	Для Каждого Роль из Метаданные.Роли Цикл 
		НовСтр = Роли.Добавить();
		НовСтр.Роль = Роль.Имя;
		НовСтр.Флаг = ?(НЕ Пользователь = "", Пользователь.Роли.Содержит(Роль), Роль.Имя = "Пользователь");
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если Пароль = ПодтверждениеПароля Тогда
		Ошибка = "";
		ЗаписатьПользователяНаСервере(Ошибка);
		Если ПустаяСтрока(Ошибка) Тогда 
			Оповестить("ЗаписанПользователь", Имя);
			Закрыть();
		Иначе 
			ПоказатьПредупреждение(,"Запись пользователя невозможна, по причине:" + Символы.ПС + Ошибка);
		КонецЕсли;
	Иначе 
		ПоказатьПредупреждение(,"Пароль и его подтверждение не совпадают! Запись невозможна.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПользователяНаСервере(Ошибка)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	ИсключаемыеПоля = "Роли";
	ИсключаемыеПоля = ИсключаемыеПоля + ?(Найти(Пароль, "****"), ", Пароль", "");
	
	Попытка
		ЗаполнитьЗначенияСвойств(Пользователь, ЭтаФорма,, ИсключаемыеПоля);
		Пользователь.Роли.Очистить();
		Для Каждого Роль Из Роли Цикл 
			Если Роль.Флаг Тогда 
				Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.Роль));	
			КонецЕсли;
		КонецЦикла;
		Пользователь.Записать();
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Элементы.Пароль.Доступность = АутентификацияСтандартная;
	Элементы.ПодтверждениеПароля.Доступность= АутентификацияСтандартная;
	Элементы.ПользовательОС.Доступность = АутентификацияОС;
КонецПроцедуры

&НаКлиенте
Процедура Аутентификация1СПердприятияПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияОСПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ПолноеИмя = Имя;
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РолиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
