Функция ПолучитьДатуРелиза(ТестовыйКонутур) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДатыРелизовСрезПервых.Период
	               |ИЗ
	               |	РегистрСведений.ДатыРелизов.СрезПервых(&Период, ТестовыйКонтур = &ТестовыйКонтур) КАК ДатыРелизовСрезПервых";
	Запрос.УстановитьПараметр("ТестовыйКонтур", ТестовыйКонутур);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Период;	
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТекущийРелиз() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДатыРелизовСрезПервых.ТестовыйКонтур,
	               |	ДатыРелизовСрезПервых.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ДатыРелизов.СрезПервых(&Период, ) КАК ДатыРелизовСрезПервых
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка;	
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции
