Функция УстановитьУведомлениеОбОбновлении(База, Дата) Экспорт 
	
	СтруктураПар = Новый Структура;
	СтруктураПар.Вставить("Дата", Дата);
	СтруктураПараметровТекст = ЗначениеВСтрокуВнутр(СтруктураПар);
	ТекстКода = "Пар = ЗначениеИзСтрокиВнутр(TextParameters);
	|  Константы.споОбновление.Установить(Истина); 
	|  Константы.споВремяОбновления.Установить(Пар.Дата);
	|  Результат = ЗначениеВСтрокуВнутр(Истина);";
	
	Попытка
		Прокси = ПолучитьПодключение(База.ExecuteCode, База.Пользователь, База.Пароль);
		Возврат ЗначениеИзСтрокиВнутр(Прокси.ExecuteCode(ТекстКода, СтруктураПараметровТекст));
	Исключение
		Возврат ОписаниеОшибки(); 
	КонецПопытки;
	
КонецФункции

Функция ПолучитьПодключение(АдресПодключения, Логин, Пароль) Экспорт
	
	Определение = Новый WSОпределения(АдресПодключения, Логин, Пароль);
	Прокси = Новый WSПрокси(Определение, "http://execute.org", "ExecuteCode", "ExecuteCodeSoap");
	Прокси.Пользователь = Логин;		
	Прокси.Пароль = Пароль;
	Возврат Прокси;
	
КонецФункции

Функция ВыполнитьКодWS (База, ТекстКода, Параметры = Неопределено) Экспорт 
	
	СтруктураПараметровТекст = "";
	
	Если НЕ Параметры = Неопределено Тогда
		СтруктураПараметровТекст = ЗначениеВСтрокуВнутр(Параметры);	
	КонецЕсли;
	
	Попытка
		Прокси = ПолучитьПодключение(База.ExecuteCode, База.Пользователь, База.Пароль);
		Результат = ЗначениеИзСтрокиВнутр(Прокси.ExecuteCode(ТекстКода, СтруктураПараметровТекст));	
	Исключение
		Результат = "Ошибка";
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
