Функция ExecuteCode(TextCode, TextParameters)
	
	Результат = "";
	РезультатБулево = Ложь;
	
	мПользователь = "Пользователь не определен";
	
	Сервис			= "ExecuteCode";
	Операция		= "ExecuteCode";
	ДопСтрока		= "";
	
	
	Если ЭтоКодИЗОбработкиКонсольВыполненияКода(TextParameters) Тогда
		Операция = "Консоль выполнения кода";
		//	
		Параметры = ЗначениеИзСтрокиВнутр(TextParameters);
		Если ПроверитьВозможностьВыполнения(Параметры, Результат) Тогда
			ПолучитьПользователя(Параметры, мПользователь);
						
			ДопСтрока = "Код выполненный пользователем " + мПользователь + "
						|"	;
			
		Иначе
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Выполнить(TextCode);
		
		РезультатБулево = Истина;
	Исключение
		мОписаниеОшибки = ОписаниеОшибки();
		Результат = ЗначениеВСтрокуВнутр(мОписаниеОшибки);
		
		РезультатБулево = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКодИЗОбработкиКонсольВыполненияКода(СтрокаДляПарсинга)
	
	Если Найти(СтрокаДляПарсинга, "{""S"",""тзРезультат""},") > 0 
		И (Найти(СтрокаДляПарсинга, "_ЗапросНеВыполнен_") > 0 
		Или Найти(СтрокаДляПарсинга, "_Ошибка_выполнeния_") > 0 )
		Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьВозможностьВыполнения(Параметры, Результат)
		
	Если Параметры.Свойство("_Vers_ion") 
		И ПроверитьВерсиюОбработки(Параметры._Vers_ion) Тогда 
		
		Возврат Истина;
		
	Иначе                                   
		Результат = ЗначениеВСтрокуВнутр("Вы иcпoльзуeтe уcтaрeвшую вeрcию oбрaбoтки ""Кoнcoль выпoлнeния кoдa""! Рaбoтa c нeй нeвoзмoжнa, oбрaтитecь к рaзрaбoтчикaм.");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьПользователя(Параметры, мПользователь)
		
	Если Параметры.Свойство("Пользователь_ВЛ") Тогда 
		мПользователь = Параметры.Пользователь_ВЛ;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьВерсиюОбработки(Версия)
	
	Если Найти(Версия, "#1.0.0.2") > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции