&НаСервере
Функция ПарольУстановлен() Экспорт 
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().ПарольУстановлен;	
КонецФункции

&НаСервере
Функция ПолучитьСкриптЗапускаБазы(База) Экспорт
	
	Возврат """"+КаталогПрограммы()+"1cv8.exe"" DESIGNER /S"""+База.Сервер+":"+формат(База.ПортКластера, "ЧГ=0")+"\"+База+""""+?(ЗначениеЗаполнено(База.Пользователь), " /N """+База.Пользователь+"""", "") + ?(ЗначениеЗаполнено(База.Пароль), " /P """+База.Пароль+"""", "")+ " /UC "+Константы.КодБлокировки.Получить()+" /ConfigurationRepositoryF"""+База.Хранилище+""" /ConfigurationRepositoryN"""+База.ПользовательХранилища+""" /ConfigurationRepositoryP"""+База.ПарольХранилища+"""";		
		
КонецФункции

&НаСервере
Процедура ЗаписатьИмяКомпьютера(ИмяКомпьютера) Экспорт
	
	ПараметрыСеанса.ИмяКомпьютера = ИмяКомпьютера;
	
	Если НЕ ПустаяСтрока(ИмяКомпьютера) Тогда 
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект();
		ТекПользователь.ИмяКомпьютера = ИмяКомпьютера;
		ТекПользователь.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПользовательСуществует() Экспорт
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя <> "";
	
КонецФункции


