
&НаКлиенте
Процедура ЗаполнитьДаты(Команда)
	Форма = ПолучитьФорму("РегистрСведений.ДатыРелизов.Форма.ФормаЗаполненияРегистра");
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьпоследнююЗаписьНаДату();
КонецПроцедуры

&НаСервере
Процедура ПолучитьпоследнююЗаписьНаДату()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Период, ТестовыйКонтур ИЗ РегистрСведений.ДатыРелизов.СрезПервых(&Дата, ) УПОРЯДОЧИТЬ ПО Период");
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		КлючЗаписи = РегистрыСведений.ДатыРелизов.СоздатьКлючЗаписи(Новый Структура("Период, ТестовыйКонтур", Выборка.Период, Выборка.ТестовыйКонтур));
	КонецЕсли;
	Элементы.Список.ТекущаяСтрока = КлючЗаписи;
КонецПроцедуры
