&НаСервере
Процедура УдалениеСтарыхЛогов() Экспорт 
	
	Дата = ТекущаяДата() - Константы.ДнейХраненияЛогов.Получить()*24*60*60;
	
	Набор = РегистрыСведений.Логи.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Логи.Период,
		|	Логи.База,
		|	Логи.Лог,
		|	Логи.Результат,
		|	Логи.ДатаОкончания,
		|	Логи.Пользователь
		|ИЗ
		|	РегистрСведений.Логи КАК Логи
		|ГДЕ
		|	Логи.Период >= &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Выгрузка  = Запрос.Выполнить().Выгрузить();
	Набор.Загрузить(Выгрузка);
	Набор.Записать(Истина);
	
	Набор = РегистрыСведений.БлокировкиБаз.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкиБаз.Период,
		|	БлокировкиБаз.База,
		|	БлокировкиБаз.Состояние,
		|	БлокировкиБаз.ЗавершениеРаботы,
		|	БлокировкиБаз.Пользователь
		|ИЗ
		|	РегистрСведений.БлокировкиБаз КАК БлокировкиБаз
		|ГДЕ
		|	БлокировкиБаз.Период >= &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Выгрузка  = Запрос.Выполнить().Выгрузить();
	Набор.Загрузить(Выгрузка);
	Набор.Записать(Истина);
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьЛога(База, Дата) Экспорт
	
	Набор = РегистрыСведений.Логи.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Значение = Дата;
	Набор.Отбор.Период.Использование = Истина;
	Набор.Отбор.База.Значение = База;
	Набор.Отбор.База.Использование = Истина;
	Набор.Записать(Истина);
	
КонецПроцедуры