&НаКлиенте
Процедура ПриНачалеРаботыСистемы()
	
	РаботаСПользователем.ЗаписатьИмяКомпьютера(ПолучитьИмяКомпьютераСУчетомТерминала());
	
	ОткрытьФорму("Обработка.ОбновлениеТК.Форма.Форма");
	Если РаботаСПользователем.ПользовательСуществует() И НЕ РаботаСПользователем.ПарольУстановлен() Тогда 
		ОткрытьФорму("ОбщаяФорма.ФормаПароля");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяКомпьютераСУчетомТерминала()
	
	Результат = "";
	#Если НЕ ВебКлиент Тогда
		Shell = Новый COMОбъект("WScript.Shell");
		ИмяМашины =  НРег(Shell.ExpandEnvironmentStrings("%Clientname%"));
		
		Если ИмяМашины = "" ИЛИ ИмяМашины = "console" ИЛИ ИмяМашины = "%clientname%" Тогда
			Результат = ИмяКомпьютера();
		Иначе
			Результат = ИмяМашины;
		КонецЕсли;
		Shell = "";
	#КонецЕсли
	Возврат ВРег(Результат)
	
КонецФункции
