
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Обработка не доступна в ВебКлиенте!");
		Возврат;
	#КонецЕсли
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Базы.Ссылка КАК Ссылка,
	               |	Базы.ТестовыйКонтур КАК ТестовыйКонтур
	               |ИЗ
	               |	Справочник.Базы КАК Базы
	               |ГДЕ
	               |	Базы.ТестовыйКонтур В (ЗНАЧЕНИЕ(Перечисление.ТестовыеКонтуры.ТестовыйКонтур1), ЗНАЧЕНИЕ(Перечисление.ТестовыеКонтуры.ТестовыйКонтур2))
	               |	И НЕ Базы.CF
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТестовыйКонтур УБЫВ,
	               |	Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Стр = ТабличнаяЧасть.Добавить();
		Стр.База = Выборка.Ссылка;
		Стр.ТестовыйКонтур = Выборка.ТестовыйКонтур;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	
	Для Каждого Стр Из ТабличнаяЧасть Цикл
		Если Стр.Выбор Тогда 
			ЗапуститьПриложение(РаботаСПользователем.ПолучитьСкриптЗапускаБазы(Стр.База));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)	
	Для Каждого Стр Из ТабличнаяЧасть Цикл 
		Стр.Выбор = Истина;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	Для Каждого Стр Из ТабличнаяЧасть Цикл 
		Стр.Выбор = Ложь;	
	КонецЦикла;
КонецПроцедуры

